app/Controllers/MahasiswaController.php

SELECT *
FROM `tbl_mahasiswa`
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `tbl_mahasiswa`
---
    public function index()
    {
        $model = new MahasiswaModel;
        $data['title'] = 'Data Mahasiswa';
        // $data['getMahasiswa'] = $model->getMahasiswa();
        $data['getMahasiswa'] = $model->paginate(3, 'mahasiswa');